peterliu2/FreeRTOS/FreeRTOS/Demo/CORTEX_TM4C123GH6PGE_GCC/utils/uartstdio.c
    return( ( ( ( ui32Write + 1 ) % ui32Size ) == ui32Read ) ? true : false );
}
#endif

//*****************************************************************************
//
//! Determines whether the ring buffer whose pointers and size are provided
//! is empty or not.
//!
//! \param pui32Read points to the read index for the buffer.
//! \param pui32Write points to the write index for the buffer.
//!
//! This function is used to determine whether or not a given ring buffer is
//! empty.  The structure of the code is specifically to ensure that we do not
//! see warnings from the compiler related to the order of volatile accesses
//! being undefined.
//!
//! \return Returns \b true if the buffer is empty or \b false otherwise.
//
//*****************************************************************************
#ifdef UART_BUFFERED
static bool IsBufferEmpty( volatile uint32_t *pui32Read, volatile uint32_t *pui32Write )
{
    uint32_t ui32Write;
    uint32_t ui32Read;

    ui32Write = *pui32Write;
    ui32Read = *pui32Read;

    return( ( ui32Write == ui32Read ) ? true : false );
}
#endif

//*****************************************************************************
//
//! Determines the number of bytes of data contained in a ring buffer.
//!
//! \param pui32Read points to the read index for the buffer.
//! \param pui32Write points to the write index for the buffer.
//! \param ui32Size is the size of the buffer in bytes.
//!
//! This function is used to determine how many bytes of data a given ring
//! buffer currently contains.  The structure of the code is specifically to
//! ensure that we do not see warnings from the compiler related to the order
//! of volatile accesses being undefined.
//!
//! \return Returns the number of bytes of data currently in the buffer.
//
//*****************************************************************************
#ifdef UART_BUFFERED
static uint32_t GetBufferCount( volatile uint32_t *pui32Read, volatile uint32_t *pui32Write, uint32_t ui32Size )
{
    uint32_t ui32Write;
    uint32_t ui32Read;

    ui32Write = *pui32Write;
    ui32Read = *pui32Read;

    return( ( ui32Write >= ui32Read ) ? ( ui32Write - ui32Read ) : ( ui32Size - ( ui32Read - ui32Write ) ) );
}
#endif

//*****************************************************************************
//
// Take as many bytes from the transmit buffer as we have space for and move
// them into the UART transmit FIFO.
//
//*****************************************************************************
#ifdef UART_BUFFERED
static void UARTPrimeTransmit( uint32_t ui32Base )
{
    // Do we have any data to transmit?
    if( !TX_BUFFER_EMPTY ) {
        // Disable the UART interrupt.  If we don't do this there is a race
        // condition which can cause the read index to be corrupted.
        //MAP_IntDisable( g_ui32UARTInt[ g_ui32PortNum ] );
		uint32_t ulStoreInterrputMask = portSET_INTERRUPT_MASK_FROM_ISR();

        // Yes - take some characters out of the transmit buffer and feed
        // them to the UART transmit FIFO.
        while( MAP_UARTSpaceAvail( ui32Base ) && !TX_BUFFER_EMPTY ) {
            MAP_UARTCharPutNonBlocking( ui32Base, g_pcUARTTxBuffer[ g_ui32UARTTxReadIndex ] );
            ADVANCE_TX_BUFFER_INDEX( g_ui32UARTTxReadIndex );
        }

        // Reenable the UART interrupt.
        //MAP_IntEnable( g_ui32UARTInt[ g_ui32PortNum ] );
		portCLEAR_INTERRUPT_MASK_FROM_ISR( ulStoreInterrputMask );
    }
}
#endif

//*****************************************************************************
//
//! Configures the UART console.
//!
//! \param ui32PortNum is the number of UART port to use for the serial console
//! (0-2)
//! \param ui32Baud is the bit rate that the UART is to be configured to use.
//! \param ui32SrcClock is the frequency of the source clock for the UART
//! module.
//!
//! This function will configure the specified serial port to be used as a
//! serial console.  The serial parameters are set to the baud rate
//! specified by the \e ui32Baud parameter and use 8 bit, no parity, and 1 stop
//! bit.
//!
//! This function must be called prior to using any of the other UART console
//! functions: UARTprintf() or UARTgets().  This function assumes that the
//! caller has previously configured the relevant UART pins for operation as a
//! UART rather than as GPIOs.
//!
//! \return None.
//
//*****************************************************************************
void UARTStdioConfig( uint32_t ui32PortNum, uint32_t ui32Baud, uint32_t ui32SrcClock )
{
    // Check the arguments.
    configASSERT( ( ui32PortNum == 0 ) || ( ui32PortNum == 1 ) || ( ui32PortNum == 2 ) );

#ifdef UART_BUFFERED
    // In buffered mode, we only allow a single instance to be opened.
    configASSERT( g_ui32Base == 0 );
#endif

    // Check to make sure the UART peripheral is present.
    if( !MAP_SysCtlPeripheralPresent( g_ui32UARTPeriph[ ui32PortNum ] ) ) {
        return;
    }

    // Select the base address of the UART.
    g_ui32Base = g_ui32UARTBase[ ui32PortNum ];

    // Enable the UART peripheral for use.
    MAP_SysCtlPeripheralEnable( g_ui32UARTPeriph[ ui32PortNum ] );

    // Configure the UART for 115200, n, 8, 1
    MAP_UARTConfigSetExpClk( g_ui32Base, ui32SrcClock, ui32Baud, ( UART_CONFIG_PAR_NONE | UART_CONFIG_STOP_ONE | UART_CONFIG_WLEN_8 ) );

#ifdef UART_BUFFERED
    // create the semaphore used to wake command line process task from Uart ISR.
    vSemaphoreCreateBinary( xUartRxCommandCompleteSemaphore );
    xSemaphoreTake( xUartRxCommandCompleteSemaphore, 0 );

    // Set the UART to interrupt whenever the TX FIFO is almost empty or
    // when any character is received.
    MAP_UARTFIFOLevelSet( g_ui32Base, UART_FIFO_TX1_8, UART_FIFO_RX1_8 );

    // Flush both the buffers.
    UARTFlushRx();
    UARTFlushTx( true );

    // Remember which interrupt we are dealing with.
    g_ui32PortNum = ui32PortNum;

	// setting UART interrupt priority
	IntPrioritySet( g_ui32UARTInt[ ui32PortNum ], configKERNEL_INTERRUPT_PRIORITY );

