peterliu2/FreeRTOS/FreeRTOS/Demo/CORTEX_TM4C123GH6PGE_GCC/utils/uartstdio.c
    // We are configured for buffered output so enable the master interrupt
    // for this UART and the receive interrupts.  We don't actually enable the
    // transmit interrupt in the UART itself until some data has been placed
    // in the transmit buffer.
    MAP_UARTIntDisable( g_ui32Base, 0xFFFFFFFF );
    MAP_UARTIntEnable( g_ui32Base, UART_INT_RX | UART_INT_RT );
    MAP_IntEnable( g_ui32UARTInt[ ui32PortNum ] );
#endif

    // Enable the UART operation.
    MAP_UARTEnable( g_ui32Base );
}

//*****************************************************************************
//
//! Writes a string of characters to the UART output.
//!
//! \param pcBuf points to a buffer containing the string to transmit.
//! \param ui32Len is the length of the string to transmit.
//!
//! This function will transmit the string to the UART output.  The number of
//! characters transmitted is determined by the \e ui32Len parameter.  This
//! function does no interpretation or translation of any characters.  Since
//! the output is sent to a UART, any LF (/n) characters encountered will be
//! replaced with a CRLF pair.
//!
//! Besides using the \e ui32Len parameter to stop transmitting the string, if
//! a null character (0) is encountered, then no more characters will be
//! transmitted and the function will return.
//!
//! In non-buffered mode, this function is blocking and will not return until
//! all the characters have been written to the output FIFO.  In buffered mode,
//! the characters are written to the UART transmit buffer and the call returns
//! immediately.  If insufficient space remains in the transmit buffer,
//! additional characters are discarded.
//!
//! \return Returns the count of characters written.
//
//*****************************************************************************
int UARTwrite( const char *pcBuf, uint32_t ui32Len )
{
#ifdef UART_BUFFERED
    unsigned int uIdx;

    // Check for valid arguments.
    configASSERT( pcBuf != 0 );
    configASSERT( g_ui32Base != 0 );

    // Send the characters
    for( uIdx = 0; uIdx < ui32Len; uIdx++ ) {
        // If the character to the UART is \n, then add a \r before it so that
        // \n is translated to \r\n in the output.
        if( pcBuf[ uIdx ] == '\n' ) {
            if( !TX_BUFFER_FULL ) {
                g_pcUARTTxBuffer[ g_ui32UARTTxWriteIndex ] = '\r';
                ADVANCE_TX_BUFFER_INDEX( g_ui32UARTTxWriteIndex );
            } else {
                // Buffer is full - discard remaining characters and return.
                break;
            }
        }

        // Send the character to the UART output.
        if( !TX_BUFFER_FULL ) {
            g_pcUARTTxBuffer[ g_ui32UARTTxWriteIndex ] = pcBuf[ uIdx ];
            ADVANCE_TX_BUFFER_INDEX( g_ui32UARTTxWriteIndex );
        } else {
            // Buffer is full - discard remaining characters and return.
            break;
        }
    }

    // If we have anything in the buffer, make sure that the UART is set
    // up to transmit it.
    if( !TX_BUFFER_EMPTY ) {
        UARTPrimeTransmit( g_ui32Base );
        MAP_UARTIntEnable( g_ui32Base, UART_INT_TX );
    }

    // Return the number of characters written.
    return(uIdx);
#else
    unsigned int uIdx;

    // Check for valid UART base address, and valid arguments.
    configASSERT(g_ui32Base != 0);
    configASSERT(pcBuf != 0);

    // Send the characters
    for(uIdx = 0; uIdx < ui32Len; uIdx++) {
        // If the character to the UART is \n, then add a \r before it so that
        // \n is translated to \n\r in the output.
        if(pcBuf[uIdx] == '\n') {
            MAP_UARTCharPut(g_ui32Base, '\r');
        }

        // Send the character to the UART output.
        MAP_UARTCharPut(g_ui32Base, pcBuf[uIdx]);
    }

    // Return the number of characters written.
    return(uIdx);
#endif
}

//*****************************************************************************
//
//! A simple UART based get string function, with some line processing.
//!
//! \param pcBuf points to a buffer for the incoming string from the UART.
//! \param ui32Len is the length of the buffer for storage of the string,
//! including the trailing 0.
//!
//! This function will receive a string from the UART input and store the
//! characters in the buffer pointed to by \e pcBuf.  The characters will
//! continue to be stored until a termination character is received.  The
//! termination characters are CR, LF, or ESC.  A CRLF pair is treated as a
//! single termination character.  The termination characters are not stored in
//! the string.  The string will be terminated with a 0 and the function will
//! return.
//!
//! In both buffered and unbuffered modes, this function will block until
//! a termination character is received.  If non-blocking operation is required
//! in buffered mode, a call to UARTPeek() may be made to determine whether
//! a termination character already exists in the receive buffer prior to
//! calling UARTgets().
//!
//! Since the string will be null terminated, the user must ensure that the
//! buffer is sized to allow for the additional null character.
//!
//! \return Returns the count of characters that were stored, not including
//! the trailing 0.
//
//*****************************************************************************
int UARTgets( char *pcBuf, uint32_t ui32Len )
{
#ifdef UART_BUFFERED
    uint32_t ui32Count = 0;
    int8_t cChar;

    // Check the arguments.
    configASSERT( pcBuf != 0 );
    configASSERT( ui32Len != 0 );
    configASSERT( g_ui32Base != 0 );

    // wait for Uart ISR to wake this task */
    while ( xSemaphoreTake( xUartRxCommandCompleteSemaphore, portMAX_DELAY ) != pdPASS );

    // Adjust the length back by 1 to leave space for the trailing
    // null terminator.
    //ui32Len--;

    // Process characters until a newline is received.
    while( 1 ) {
        // Read the next character from the receive buffer.
        if( !RX_BUFFER_EMPTY ) {
            cChar = g_pcUARTRxBuffer[ g_ui32UARTRxReadIndex ];
            ADVANCE_RX_BUFFER_INDEX( g_ui32UARTRxReadIndex );

