peterliu2/FreeRTOS/FreeRTOS/Demo/CORTEX_TM4C123GH6PGE_GCC/utils/uartstdio.c
            // See if a newline or escape character was received.
            if( cChar == '\n' )	{
                // Stop processing the input and end the line.
                break;
            }

            // Process the received character as long as we are not at the end
            // of the buffer.  If the end of the buffer has been reached then
            // all additional characters are ignored until a newline is
            // received.
            if( ui32Count < ui32Len ) {
                // Store the character in the caller supplied buffer.
                pcBuf[ ui32Count ] = cChar;

                // Increment the count of characters received.
                ui32Count++;
            }
        }
    }

    // Add a newline character to inducate the string is terminated.
    pcBuf[ ui32Count++ ] = '\n';

    // Return the count of in the buffer, counting the trailing '\n'.
    return( ui32Count );
#else
    uint32_t ui32Count = 0;
    int8_t cChar;
    static int8_t bLastWasCR = 0;

    // Check the arguments.
    configASSERT(pcBuf != 0);
    configASSERT(ui32Len != 0);
    configASSERT(g_ui32Base != 0);

    // Adjust the length back by 1 to leave space for the trailing
    // null terminator.
    ui32Len--;

    // Process characters until a newline is received.
    while(1) {
        // Read the next character from the console.
        cChar = MAP_UARTCharGet(g_ui32Base);

        // See if the backspace key was pressed.
        if(cChar == '\b') {
            // If there are any characters already in the buffer, then delete
            // the last.
            if(ui32Count) {
                // Rub out the previous character.
                UARTwrite("\b \b", 3);

                // Decrement the number of characters in the buffer.
                ui32Count--;
            }

            // Skip ahead to read the next character.
            continue;
        }

        // If this character is LF and last was CR, then just gobble up the
        // character because the EOL processing was taken care of with the CR.
        if((cChar == '\n') && bLastWasCR) {
            bLastWasCR = 0;
            continue;
        }

        // See if a newline or escape character was received.
        if((cChar == '\r') || (cChar == '\n') || (cChar == 0x1b)) {
            // If the character is a CR, then it may be followed by a LF which
            // should be paired with the CR.  So remember that a CR was
            // received.
            if(cChar == '\r') {
                bLastWasCR = 1;
            }

            // Stop processing the input and end the line.
            break;
        }

        // Process the received character as long as we are not at the end of
        // the buffer.  If the end of the buffer has been reached then all
        // additional characters are ignored until a newline is received.
        if(ui32Count < ui32Len) {
            // Store the character in the caller supplied buffer.
            pcBuf[ui32Count] = cChar;

            // Increment the count of characters received.
            ui32Count++;

            // Reflect the character back to the user.
            MAP_UARTCharPut(g_ui32Base, cChar);
        }
    }

    // Add a null termination to the string.
    pcBuf[ui32Count] = 0;

    // Send a CRLF pair to the terminal to end the line.
    UARTwrite("\r\n", 2);

    // Return the count of int8_ts in the buffer, not counting the trailing 0.
    return(ui32Count);
#endif
}

//*****************************************************************************
//
//! Read a single character from the UART, blocking if necessary.
//!
//! This function will receive a single character from the UART and store it at
//! the supplied address.
//!
//! In both buffered and unbuffered modes, this function will block until a
//! character is received.  If non-blocking operation is required in buffered
//! mode, a call to UARTRxAvail() may be made to determine whether any
//! characters are currently available for reading.
//!
//! \return Returns the character read.
//
//*****************************************************************************
unsigned char UARTgetc(void)
{
#ifdef UART_BUFFERED
    unsigned char cChar;

    // Wait for a character to be received.
    while( RX_BUFFER_EMPTY ) {
        // Block waiting for a character to be received (if the buffer is
        // currently empty).
    }

    // Read a character from the buffer.
    cChar = g_pcUARTRxBuffer[ g_ui32UARTRxReadIndex ];
    ADVANCE_RX_BUFFER_INDEX( g_ui32UARTRxReadIndex );

    // Return the character to the caller.
    return( cChar );
#else
    // Block until a character is received by the UART then return it to
    // the caller.
    return(MAP_UARTCharGet(g_ui32Base));
#endif
}



//*****************************************************************************
//
//! Returns the number of bytes available in the receive buffer.
//!
//! This function, available only when the module is built to operate in
//! buffered mode using \b UART_BUFFERED, may be used to determine the number
//! of bytes of data currently available in the receive buffer.
//!
//! \return Returns the number of available bytes.
//
//*****************************************************************************
#if defined(UART_BUFFERED) || defined(DOXYGEN)
int UARTRxBytesAvail(void)
{
    return( RX_BUFFER_USED );
}
#endif

#if defined(UART_BUFFERED) || defined(DOXYGEN)
//*****************************************************************************
//
//! Returns the number of bytes free in the transmit buffer.
//!
//! This function, available only when the module is built to operate in
//! buffered mode using \b UART_BUFFERED, may be used to determine the amount
//! of space currently available in the transmit buffer.
//!
//! \return Returns the number of free bytes.
//
//*****************************************************************************
int UARTTxBytesFree(void)
{
    return( TX_BUFFER_FREE );
}
#endif

//*****************************************************************************
//
//! Looks ahead in the receive buffer for a particular character.
//!
//! \param ucChar is the character that is to be searched for.
//!
//! This function, available only when the module is built to operate in
//! buffered mode using \b UART_BUFFERED, may be used to look ahead in the
//! receive buffer for a particular character and report its position if found.
//! It is typically used to determine whether a complete line of user input is
//! available, in which case ucChar should be set to CR ('\\r') which is used
//! as the line end marker in the receive buffer.
//!
//! \return Returns -1 to indicate that the requested character does not exist
//! in the receive buffer.  Returns a non-negative number if the character was
//! found in which case the value represents the position of the first instance
//! of \e ucChar relative to the receive buffer read pointer.
//
//*****************************************************************************
#if defined(UART_BUFFERED) || defined(DOXYGEN)
int UARTPeek( unsigned char ucChar )
{
    int iCount;
    int iAvail;
    uint32_t ui32ReadIndex;

    // How many characters are there in the receive buffer?
    iAvail = ( int ) RX_BUFFER_USED;
    ui32ReadIndex = g_ui32UARTRxReadIndex;

    // Check all the unread characters looking for the one passed.
    for( iCount = 0; iCount < iAvail; iCount++ ) {
        if( g_pcUARTRxBuffer[ui32ReadIndex] == ucChar ) {
            // We found it so return the count.
            return( iCount );
        } else {
            // This one didn't match so move on to the next character.
            ADVANCE_RX_BUFFER_INDEX( ui32ReadIndex );
        }
    }

    // If we drop out of the loop, we didn't find the character in the receive
    // buffer.
    return(-1);
}
#endif

//*****************************************************************************
//
//! Flushes the receive buffer.
//!
//! This function, available only when the module is built to operate in
//! buffered mode using \b UART_BUFFERED, may be used to discard any data
//! received from the UART but not yet read using UARTgets().
//!
//! \return None.
//
//*****************************************************************************
#if defined(UART_BUFFERED) || defined(DOXYGEN)
void UARTFlushRx(void)
{
    // Temporarily turn off interrupts.
    //uint32_t ui32Int = MAP_IntMasterDisable();
    portENTER_CRITICAL();

    // Flush the receive buffer.
    g_ui32UARTRxReadIndex = 0;
    g_ui32UARTRxWriteIndex = 0;

