peterliu2/FreeRTOS/FreeRTOS/Demo/CORTEX_TM4C123GH6PGE_GCC/utils/uartstdio.c
    // If interrupts were enabled when we turned them off, turn them
    // back on again.
    //if(!ui32Int) {
    //    MAP_IntMasterEnable();
    //}
    portEXIT_CRITICAL();
}
#endif

//*****************************************************************************
//
//! Flushes the transmit buffer.
//!
//! \param bDiscard indicates whether any remaining data in the buffer should
//! be discarded (\b true) or transmitted (\b false).
//!
//! This function, available only when the module is built to operate in
//! buffered mode using \b UART_BUFFERED, may be used to flush the transmit
//! buffer, either discarding or transmitting any data received via calls to
//! UARTprintf() that is waiting to be transmitted.  On return, the transmit
//! buffer will be empty.
//!
//! \return None.
//
//*****************************************************************************
#if defined(UART_BUFFERED) || defined(DOXYGEN)
void UARTFlushTx( bool bDiscard )
{
    // Should the remaining data be discarded or transmitted?
    if( bDiscard ) {
        // The remaining data should be discarded, so temporarily turn off
        // interrupts.
        //uint32_t ui32Int = MAP_IntMasterDisable();
        portENTER_CRITICAL();

        // Flush the transmit buffer.
        g_ui32UARTTxReadIndex = 0;
        g_ui32UARTTxWriteIndex = 0;

        // If interrupts were enabled when we turned them off, turn them
        // back on again.
        //if(!ui32Int) {
        //    MAP_IntMasterEnable();
        //}
        portEXIT_CRITICAL();
    } else {
        // Wait for all remaining data to be transmitted before returning.
        while( !TX_BUFFER_EMPTY );
    }
}
#endif

//*****************************************************************************
//
//! Enables or disables echoing of received characters to the transmitter.
//!
//! \param bEnable must be set to \b true to enable echo or \b false to
//! disable it.
//!
//! This function, available only when the module is built to operate in
//! buffered mode using \b UART_BUFFERED, may be used to control whether or not
//! received characters are automatically echoed back to the transmitter.  By
//! default, echo is enabled and this is typically the desired behavior if
//! the module is being used to support a serial command line.  In applications
//! where this module is being used to provide a convenient, buffered serial
//! interface over which application-specific binary protocols are being run,
//! however, echo may be undesirable and this function can be used to disable
//! it.
//!
//! \return None.
//
//*****************************************************************************
#if defined(UART_BUFFERED) || defined(DOXYGEN)
void UARTEchoSet( bool bEnable )
{
    g_bDisableEcho = !bEnable;
}
#endif

//*****************************************************************************
//
//! Handles UART interrupts.
//!
//! This function handles interrupts from the UART.  It will copy data from the
//! transmit buffer to the UART transmit FIFO if space is available, and it
//! will copy data from the UART receive FIFO to the receive buffer if data is
//! available.
//!
//! \return None.
//
//*****************************************************************************
#if defined(UART_BUFFERED) || defined(DOXYGEN)
void UART0_IRQHandler( void )
{
    uint32_t ui32Ints;
    char cChar;
    static bool bLastWasCR = false;

    // Get and clear the current interrupt source(s)
    ui32Ints = MAP_UARTIntStatus( g_ui32Base, true );
    MAP_UARTIntClear( g_ui32Base, ui32Ints );

    // Are we being interrupted because the TX FIFO has space available?
    if( ui32Ints & UART_INT_TX ) {
        // Move as many bytes as we can into the transmit FIFO.
        UARTPrimeTransmit( g_ui32Base );

        // If the output buffer is empty, turn off the transmit interrupt.
        if( TX_BUFFER_EMPTY ) {
            MAP_UARTIntDisable( g_ui32Base, UART_INT_TX );
        }
    }

    // Are we being interrupted due to a received character?
    if( ui32Ints & ( UART_INT_RX | UART_INT_RT ) ) {
        // Get all the available characters from the UART.
        while( MAP_UARTCharsAvail( g_ui32Base ) ) {
            // Read a character
            cChar = ( char )( MAP_UARTCharGetNonBlocking( g_ui32Base ) & 0xFF);

            // If echo is disabled, we skip the various text filtering
            // operations that would typically be required when supporting a
            // command line.
            if( !g_bDisableEcho ) {
                // Handle backspace by erasing the last character in the
                // buffer.
                if( cChar == '\b' ) {
                    // If there are any characters already in the buffer, then
                    // delete the last.
                    if( !RX_BUFFER_EMPTY ) {
                        // Rub out the previous character on the users
                        // terminal.
                        UARTwrite( "\b \b", 3 );

                        // Decrement the number of characters in the buffer.
                        if( g_ui32UARTRxWriteIndex == 0 ) {
                            g_ui32UARTRxWriteIndex = UART_RX_BUFFER_SIZE - 1;
                        } else {
                            g_ui32UARTRxWriteIndex--;
                        }
                    }

                    // Skip ahead to read the next character.
                    continue;
                }

                // If this character is LF and last was CR, then just gobble up
                // the character since we already echoed the previous CR and we
                // don't want to store 2 characters in the buffer if we don't
                // need to.
                if( ( cChar == '\n' ) && bLastWasCR ) {
                    bLastWasCR = false;
                    continue;
                }

