peterliu2/FreeRTOS/FreeRTOS/Demo/CORTEX_TM4C123GH6PGE_GCC/utils/uartstdio.c
                // See if a newline or escape character was received.
                if( ( cChar == '\r' ) || ( cChar == '\n' ) || ( cChar == 0x1b ) ) {
                    // If the character is a CR, then it may be followed by an
                    // LF which should be paired with the CR.  So remember that
                    // a CR was received.
                    if( cChar == '\r' ) {
                        bLastWasCR = 1;
                    }

                    // Regardless of the line termination character received,
                    // put a LF in the receive buffer as a marker telling
                    // UARTgets() where the line ends.  We also send an
                    // additional CR to ensure that the local terminal echo
                    // receives both CR and LF.
                    cChar = '\n';
                    UARTwrite( "\r", 1 );

                    // Wake the command line process.
                    portBASE_TYPE xHigherPriorityTaskWoken = pdFALSE;
                    xSemaphoreGiveFromISR( xUartRxCommandCompleteSemaphore, & xHigherPriorityTaskWoken );
                    portEND_SWITCHING_ISR( xHigherPriorityTaskWoken );
                }
            }

            // If there is space in the receive buffer, put the character
            // there, otherwise throw it away.
            if( !RX_BUFFER_FULL ) {
                // Store the new character in the receive buffer
                g_pcUARTRxBuffer[ g_ui32UARTRxWriteIndex ] = cChar;
                ADVANCE_RX_BUFFER_INDEX( g_ui32UARTRxWriteIndex );

                // If echo is enabled, write the character to the transmit
                // buffer so that the user gets some immediate feedback.
                if( !g_bDisableEcho ) {
                    UARTwrite( ( const char * ) &cChar, 1 );
                }
            }
        }

        // If we wrote anything to the transmit buffer, make sure it actually
        // gets transmitted.
        UARTPrimeTransmit( g_ui32Base );
        MAP_UARTIntEnable( g_ui32Base, UART_INT_TX );
    }
}
#endif

//*****************************************************************************
//
// Close the Doxygen group.
//! @}
//
//*****************************************************************************
